In [1]:
import pandas as pd
import datetime

In [2]:
df = pd.read_csv(
    '../test/sample_data.csv'
)
df["time"] = pd.Series([
    datetime.datetime.strptime(y, "%Y-%m-%d %H:%M:%S")
    for y in df["time"]
])
df = df.set_index("time")
df

                      name  sales  dummy
time
2021-09-03 01:07:00  xuwsn  10300    NaN
2021-09-03 01:18:00  kqnrm  49337    NaN
2021-09-03 02:52:00  loooj   6831    NaN
2021-09-03 03:11:00  heeyf  45102    NaN
2021-09-03 04:21:00  kkocy  16011    NaN
...                    ...    ...    ...
2022-03-30 22:35:00  pbblb  14625    NaN
2022-03-30 23:48:00  fuhyl  27993    NaN
2022-03-31 00:45:00  fpwqy  10180    NaN
2022-03-31 01:22:00  xghhg  10242    NaN
2022-03-31 03:22:00  ugmmj  18075    NaN

[5000 rows x 3 columns]

In [3]:
df[df["sales"] >= 2000]

                      name  sales  dummy
time
2021-09-03 01:07:00  xuwsn  10300    NaN
2021-09-03 01:18:00  kqnrm  49337    NaN
2021-09-03 02:52:00  loooj   6831    NaN
2021-09-03 03:11:00  heeyf  45102    NaN
2021-09-03 04:21:00  kkocy  16011    NaN
...                    ...    ...    ...
2022-03-30 22:35:00  pbblb  14625    NaN
2022-03-30 23:48:00  fuhyl  27993    NaN
2022-03-31 00:45:00  fpwqy  10180    NaN
2022-03-31 01:22:00  xghhg  10242    NaN
2022-03-31 03:22:00  ugmmj  18075    NaN

[4807 rows x 3 columns]

In [4]:
df[(df["sales"]>1000)&(df["sales"]<3000)]

                      name  sales  dummy
time
2021-09-04 17:47:00  qyvvz   2081    NaN
2021-09-08 14:53:00  ugmmj   1507    NaN
2021-09-09 13:50:00  njxbk   2095    NaN
2021-09-12 03:25:00  bhuht   2016    NaN
2021-09-13 00:47:00  lneqo   1903    NaN
...                    ...    ...    ...
2022-03-26 14:00:00  stlip   2318    NaN
2022-03-27 11:57:00  uamgi   1762    NaN
2022-03-28 05:12:00  lczul   1254    NaN
2022-03-28 12:54:00  tihne   1336    NaN
2022-03-29 10:03:00  pskis   1328    NaN

[206 rows x 3 columns]

In [5]:
df.sort_values("name")
df.sort_values("name")
df.sort_values("sales")
df.sort_values("time")

                      name  sales  dummy
time
2021-09-03 01:07:00  xuwsn  10300    NaN
2021-09-03 01:18:00  kqnrm  49337    NaN
2021-09-03 02:52:00  loooj   6831    NaN
2021-09-03 03:11:00  heeyf  45102    NaN
2021-09-03 04:21:00  kkocy  16011    NaN
...                    ...    ...    ...
2022-03-30 22:35:00  pbblb  14625    NaN
2022-03-30 23:48:00  fuhyl  27993    NaN
2022-03-31 00:45:00  fpwqy  10180    NaN
2022-03-31 01:22:00  xghhg  10242    NaN
2022-03-31 03:22:00  ugmmj  18075    NaN

[5000 rows x 3 columns]

In [6]:
df.drop_duplicates()

                      name  sales  dummy
time
2021-09-03 01:07:00  xuwsn  10300    NaN
2021-09-03 01:18:00  kqnrm  49337    NaN
2021-09-03 02:52:00  loooj   6831    NaN
2021-09-03 03:11:00  heeyf  45102    NaN
2021-09-03 04:21:00  kkocy  16011    NaN
...                    ...    ...    ...
2022-03-30 22:35:00  pbblb  14625    NaN
2022-03-30 23:48:00  fuhyl  27993    NaN
2022-03-31 00:45:00  fpwqy  10180    NaN
2022-03-31 01:22:00  xghhg  10242    NaN
2022-03-31 03:22:00  ugmmj  18075    NaN

[4997 rows x 3 columns]

In [7]:
df.groupby(["time","name"]).mean()
df.groupby(["time","name"]).max()

                           sales  dummy
time                name
2021-09-03 01:07:00 xuwsn  10300    NaN
2021-09-03 01:18:00 kqnrm  49337    NaN
2021-09-03 02:52:00 loooj   6831    NaN
2021-09-03 03:11:00 heeyf  45102    NaN
2021-09-03 04:21:00 kkocy  16011    NaN
...                          ...    ...
2022-03-30 22:35:00 pbblb  14625    NaN
2022-03-30 23:48:00 fuhyl  27993    NaN
2022-03-31 00:45:00 fpwqy  10180    NaN
2022-03-31 01:22:00 xghhg  10242    NaN
2022-03-31 03:22:00 ugmmj  18075    NaN

[5000 rows x 2 columns]

In [8]:
df.groupby(["time","name"]).agg({"sales":lambda x: x.mean()/100})

                            sales
time                name
2021-09-03 01:07:00 xuwsn  103.00
2021-09-03 01:18:00 kqnrm  493.37
2021-09-03 02:52:00 loooj   68.31
2021-09-03 03:11:00 heeyf  451.02
2021-09-03 04:21:00 kkocy  160.11
...                           ...
2022-03-30 22:35:00 pbblb  146.25
2022-03-30 23:48:00 fuhyl  279.93
2022-03-31 00:45:00 fpwqy  101.80
2022-03-31 01:22:00 xghhg  102.42
2022-03-31 03:22:00 ugmmj  180.75

[5000 rows x 1 columns]

In [9]:
def f(d):
    c = 0
    if d["name"].iloc[0] == df["name"][0]:
        c = d["sales"].mean()/10
    else:
        c = d["sales"].mean()*10
    return pd.Series({
        "sales_changed": c
    })
df.groupby(["time","name"]).apply(f)

                           sales_changed
time                name
2021-09-03 01:07:00 xuwsn         1030.0
2021-09-03 01:18:00 kqnrm       493370.0
2021-09-03 02:52:00 loooj        68310.0
2021-09-03 03:11:00 heeyf       451020.0
2021-09-03 04:21:00 kkocy       160110.0
...                                  ...
2022-03-30 22:35:00 pbblb       146250.0
2022-03-30 23:48:00 fuhyl       279930.0
2022-03-31 00:45:00 fpwqy       101800.0
2022-03-31 01:22:00 xghhg       102420.0
2022-03-31 03:22:00 ugmmj       180750.0

[5000 rows x 1 columns]

In [46]:
df.resample("H").sum()

                     sales  dummy
time
2021-09-03 01:00:00  59637    0.0
2021-09-03 02:00:00   6831    0.0
2021-09-03 03:00:00  45102    0.0
2021-09-03 04:00:00  16011    0.0
2021-09-03 05:00:00      0    0.0
...                    ...    ...
2022-03-30 23:00:00  27993    0.0
2022-03-31 00:00:00  10180    0.0
2022-03-31 01:00:00  10242    0.0
2022-03-31 02:00:00      0    0.0
2022-03-31 03:00:00  18075    0.0

[5019 rows x 2 columns]

In [11]:
df.resample("30T").mean()

                       sales  dummy
time
2021-09-03 01:00:00  29818.5    NaN
2021-09-03 01:30:00      NaN    NaN
2021-09-03 02:00:00      NaN    NaN
2021-09-03 02:30:00   6831.0    NaN
2021-09-03 03:00:00  45102.0    NaN
...                      ...    ...
2022-03-31 01:00:00  10242.0    NaN
2022-03-31 01:30:00      NaN    NaN
2022-03-31 02:00:00      NaN    NaN
2022-03-31 02:30:00      NaN    NaN
2022-03-31 03:00:00  18075.0    NaN

[10037 rows x 2 columns]

In [12]:
df.resample("30T").agg({"sales":lambda x: x.sum()*100})

                       sales
time
2021-09-03 01:00:00  5963700
2021-09-03 01:30:00        0
2021-09-03 02:00:00        0
2021-09-03 02:30:00   683100
2021-09-03 03:00:00  4510200
...                      ...
2022-03-31 01:00:00  1024200
2022-03-31 01:30:00        0
2022-03-31 02:00:00        0
2022-03-31 02:30:00        0
2022-03-31 03:00:00  1807500

[10037 rows x 1 columns]

In [13]:
def f2(d):
    c = 0
    if len(d) == 0:
        c = None
    elif d["name"].iloc[0] == df["name"][0]:
        c = d["sales"].mean()/10
    else:
        c = d["sales"].mean()*10
    return pd.Series({
        "sales_changed": c
    })
df.resample("30T").apply(f2)

                     sales_changed
time
2021-09-03 01:00:00        2981.85
2021-09-03 01:30:00            NaN
2021-09-03 02:00:00            NaN
2021-09-03 02:30:00       68310.00
2021-09-03 03:00:00      451020.00
...                            ...
2022-03-31 01:00:00      102420.00
2022-03-31 01:30:00            NaN
2022-03-31 02:00:00            NaN
2022-03-31 02:30:00            NaN
2022-03-31 03:00:00      180750.00

[10037 rows x 1 columns]

In [14]:
df.rolling(5).sum()

                        sales  dummy
time
2021-09-03 01:07:00       NaN    NaN
2021-09-03 01:18:00       NaN    NaN
2021-09-03 02:52:00       NaN    NaN
2021-09-03 03:11:00       NaN    NaN
2021-09-03 04:21:00  127581.0    NaN
...                       ...    ...
2022-03-30 22:35:00   91060.0    NaN
2022-03-30 23:48:00   92046.0    NaN
2022-03-31 00:45:00   80840.0    NaN
2022-03-31 01:22:00   86035.0    NaN
2022-03-31 03:22:00   81115.0    NaN

[5000 rows x 2 columns]

In [43]:
def f3(d):
    c = 0
    if len(d) == 0:
        c = None
    elif df.loc[d.index, "name"][0] == df["name"][0]:
        c = d.mean()/10
    else:
        c = d.mean()*10
    return c
df.rolling(3).apply(f3)

                             sales  dummy
time
2021-09-03 01:07:00            NaN    NaN
2021-09-03 01:18:00            NaN    NaN
2021-09-03 02:52:00    2215.600000    NaN
2021-09-03 03:11:00  337566.666667    NaN
2021-09-03 04:21:00  226480.000000    NaN
...                            ...    ...
2022-03-30 22:35:00  142223.333333    NaN
2022-03-30 23:48:00  218710.000000    NaN
2022-03-31 00:45:00  175993.333333    NaN
2022-03-31 01:22:00  161383.333333    NaN
2022-03-31 03:22:00  128323.333333    NaN

[5000 rows x 2 columns]

In [44]:
df.rolling("H").apply(f3)

                         sales  dummy
time
2021-09-03 01:07:00    1030.00    NaN
2021-09-03 01:18:00    2981.85    NaN
2021-09-03 02:52:00   68310.00    NaN
2021-09-03 03:11:00  259665.00    NaN
2021-09-03 04:21:00  160110.00    NaN
...                        ...    ...
2022-03-30 22:35:00  188100.00    NaN
2022-03-30 23:48:00  279930.00    NaN
2022-03-31 00:45:00  190865.00    NaN
2022-03-31 01:22:00  102110.00    NaN
2022-03-31 03:22:00  180750.00    NaN

[5000 rows x 2 columns]

In [45]:
df.rolling("30T").apply(f3)

                         sales  dummy
time
2021-09-03 01:07:00    1030.00    NaN
2021-09-03 01:18:00    2981.85    NaN
2021-09-03 02:52:00   68310.00    NaN
2021-09-03 03:11:00  259665.00    NaN
2021-09-03 04:21:00  160110.00    NaN
...                        ...    ...
2022-03-30 22:35:00  188100.00    NaN
2022-03-30 23:48:00  279930.00    NaN
2022-03-31 00:45:00  101800.00    NaN
2022-03-31 01:22:00  102420.00    NaN
2022-03-31 03:22:00  180750.00    NaN

[5000 rows x 2 columns]